Examinator/src/Catalogs/ТестовыеВопросы/ТестовыеВопросы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТестовыеВопросы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Задание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипВопроса</name>
    <type>
      <types>EnumRef.ТипыТестовыхВопросов</types>
    </type>
  </attributes>
  <attributes>
    <name>Картинка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиЭлектронныхКурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеКолонкиЭлементов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеКолонкиВариантов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/Catalogs/ВариантыОтветовНаТестовыеВопросы/ВариантыОтветовНаТестовыеВопросы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВариантыОтветовНаТестовыеВопросы</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ТестовыеВопросы</owners>
  <attributes>
    <name>ТекстВарианта</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Верный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Картинка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиЭлектронныхКурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбластьНаКартинке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПоляВвода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоЭлементСоответствия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВариантыЭлементаСоответствия</name>
    <attributes>
      <name>ВариантОтвета</name>
      <type>
        <types>CatalogRef.ВариантыОтветовНаТестовыеВопросы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/ТестовыеВопросы/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

Функция ДанныеВопросаДляПросмотра(Вопрос) Экспорт
	
	Если ТипЗнч(Вопрос) = Тип("Массив") Тогда
		МассивВопросов = Вопрос;
	Иначе		
		МассивВопросов = Новый Массив;
		МассивВопросов.Добавить(Вопрос);
	КонецЕсли;
	
	// Формируем таблицу вопросов
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТестовыеВопросы.Задание КАК Задание,
		|	ТестовыеВопросы.ТипВопроса КАК ТипВопроса,
		|	ТестовыеВопросы.Ссылка КАК Ссылка,
		|	ТестовыеВопросы.Картинка КАК Картинка,
		|	ТестовыеВопросы.НаименованиеКолонкиЭлементов КАК НаименованиеКолонкиЭлементов,
		|	ТестовыеВопросы.НаименованиеКолонкиВариантов КАК НаименованиеКолонкиВариантов
		|ИЗ
		|	Справочник.ТестовыеВопросы КАК ТестовыеВопросы
		|ГДЕ
		|	ТестовыеВопросы.ПометкаУдаления = ЛОЖЬ
		|	И ТестовыеВопросы.ЭтоГруппа = ЛОЖЬ
		|	И ТестовыеВопросы.Ссылка В(&МассивВопросов)";
	
	Запрос.УстановитьПараметр("МассивВопросов", МассивВопросов);
	
	ТаблицаВопросов = Запрос.Выполнить().Выгрузить();
	
	// Выбираем варианты ответов	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВариантыОтветовНаТестовыеВопросы.Верный КАК Верный,
		|	ВариантыОтветовНаТестовыеВопросы.ТекстВарианта КАК ТекстВарианта,
		|	ВариантыОтветовНаТестовыеВопросы.Ссылка КАК Ссылка,
		|	ВариантыОтветовНаТестовыеВопросы.Код КАК Код,
		|	ВариантыОтветовНаТестовыеВопросы.Владелец КАК Вопрос,
		|	ВариантыОтветовНаТестовыеВопросы.Картинка КАК Картинка,
		|	ВариантыОтветовНаТестовыеВопросы.ОбластьНаКартинке КАК ОбластьНаКартинке,
		|	ВариантыОтветовНаТестовыеВопросы.НомерПоляВвода КАК НомерПоляВвода,
		|	ВариантыОтветовНаТестовыеВопросы.ЭтоЭлементСоответствия КАК ЭтоЭлементСоответствия,
		|	ВариантыОтветовНаТестовыеВопросы.ВариантыЭлементаСоответствия.(
		|		ВариантОтвета КАК ВариантОтвета
		|	) КАК ВариантыЭлементаСоответствия
		|ИЗ
		|	Справочник.ВариантыОтветовНаТестовыеВопросы КАК ВариантыОтветовНаТестовыеВопросы
		|ГДЕ
		|	ВариантыОтветовНаТестовыеВопросы.ПометкаУдаления = ЛОЖЬ
		|	И ВариантыОтветовНаТестовыеВопросы.Владелец В(&МассивВопросов)";
	
	Запрос.УстановитьПараметр("МассивВопросов", МассивВопросов);
	
	ТаблицаВариантов = Запрос.Выполнить().Выгрузить();
	
	// Завершаем
	
	Возврат Новый Структура("Вопросы, Варианты", ТаблицаВопросов, ТаблицаВариантов);
	
КонецФункции

#КонецОбласти

#КонецЕсли
